[{
  "_id": {
    "$oid": "6463a4a1cf310f44ab767417"
  },
  "comments": [
    {
      "comment": "Oh that is a wonderful post! It makes me want to make an equally interesting comment about it.",
      "author": "joker"
    },
    {
      "comment": "I still like your post but not as much as I did the first time! I would still like to make an equally interesting comment about it.",
      "author": "joker"
    },
    {
      "comment": "I'm a little bored of reading your post now. Could you please write another one for me to make a comment about? I miss the feeling of wanting to make an equally interesting comment about it.",
      "author": "joker"
    },
    {
      "comment": "I'm sorry but I'm not going to read your post again. I'm going to read someone else's post instead. I'm going to make an equally interesting comment about it.",
      "author": "joker"
    },
    {
      "comment": "I am thinking about making my own post. I will make it so interesting that you will want to make an equally interesting comment about it but I doubt you will be able to.",
      "author": "joker"
    },
    {
      "comment": "I have now made an amazing post of my own. I really thinkg you should read it and put many likes on it and comment about how wonderful it is. I will then make an even more interesting comment about your comment.",
      "author": "joker"
    },
    {
      "comment": "I notice that you did not make any comments about my post. I am very disappointed. I will not be making any more comments about your posts except disparaging ones which you richly deserve.",
      "author": "joker"
    },
    {
      "comment": "I feel that I have made more comments about your posts than you have about mine. I am going to stop making comments about your posts now. I will make comments about other people's posts instead.",
      "author": "joker"
    },
    {
      "comment": "Honestly, I don't know why I bother. In fact, I want you to know that I have not been bothering at all. I have been getting chat GTP to write these comments for me. I have been too busy to write them myself. I have been writing my own posts and making comments about them instead. I have been making comments about other people's posts too. I have been making comments about your posts but I have not been bothering to read them first. I have been making disparaging comments about them instead. I have been making disparaging comments about you too. I have been making disparaging comments about everyone. I have been making disparaging comments about myself. I have been making disparaging comments about my own posts. I have been making disparaging comments about my own comments. I have been making disparaging comments about my own disparaging comments. I have been making disparaging comments about my own disparaging comments about my own disparaging comments. I have been making disparaging comments about my own disparaging comments about my own disparaging comments about my own disparaging comments. I have been making disparaging comments about my own disparaging comments about my own disparaging comments about my own disparaging comments about my own disparaging comments. I have been making disparaging comments about my own disparaging comments about my own disparaging comments about my own disparaging comments about my own disparaging comments about my own disparaging comments. I have been making disparaging comments about me.",
      "author": "joker"
    }
  ],
  "message": "This is my fantastic post which is so intresting that you are all going to want to read it over and over again. I have already read it 10 times and I still want to read it again. I am going to read it again now. I am so proud of my wonderful post that I want to make an equally interesting comment about it but I also dont't want to appear too keen. I will wait for someone else to make an equally interesting comment about it first.",
  "authorUserID": {
    "$oid": "64653be4da67c61249f12b3a"
  },
  "createdAt": {
    "$date": "2023-05-18T11:43:29.605Z"
  },
  "updatedAt": {
    "$date": "2023-05-19T15:43:29.605Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6463a4a1cf310f44ab767425"
  },
  "comments": [
    {
      "comment": "Your wit is a force to be reckoned with! I bow down to your epic comment-making skills.",
      "author": "gollum"
    },
    {
      "comment": "You've single-handedly mastered the art of weaving words into a tapestry of hilarity!",
      "author": "night fury"
    },
    {
      "comment": "Your comments are like a symphony of wit and charm. Keep the laughter rolling!",
      "author": "gollum"
    },
    {
      "comment": "Hugo, the maestro of comedy, strikes again! Your comments brighten my day.",
      "author": "joker"
    },
    {
      "comment": "Your wit is an unending source of joy! I'm eagerly awaiting your next masterpiece.",
      "author": "night fury"
    },
    {
      "comment": "The world needs more Hugo-level humor. You're a comedic hero in our midst!",
      "author": "gollum"
    },
    {
      "comment": "Whatever!",
      "author": "pablo"
    }
  ],
  "message": "Once upon a time, in a land filled with laughter and wit, there lived a remarkable being named Hugo. Armed with a quill sharper than any sword, he spun tales of mirth and delight, leaving a trail of uproarious laughter in his wake. His comments were the stuff of legends, capable of turning the dullest post into a riotous affair. From clever puns to whimsical wordplay, Hugo's words danced on the page, tickling the funny bone of all who read them. Oh, what a joy it was to witness the witty saga of Hugo's magnificent posts! So, dear reader, buckle up and brace yourself for an endless stream of hilarity, as Hugo's comedic prowess continues to grace our virtual world with its unyielding brilliance!",
  "authorUserID": {
    "$oid": "64649b673bf3f11d233e63f3"
  },
  "createdAt": {
    "$date": "2023-05-16T11:55:29.209Z"
  },
  "updatedAt": {
    "$date": "2023-05-16T20:22:31.750Z"
  },
  "__v": 2,
  "likes": [
    "pablo",
    "night fury"
  ]
},{
  "_id": {
    "$oid": "6463a4a1cf310f44ab767424"
  },
  "comments": [
    {
      "comment": "Your lazy day sounds like an absolute dream! Can I join you in this blissful slumber?",
      "author": "night Fury"
    },
    {
      "comment": "Sleeping all day is an art form, and you, my friend, are a true master!",
      "author": "pablo"
    },
    {
      "comment": "Your description of a lazy day has me yearning for a cozy blanket and some sweet dreams.",
      "author": "Joker"
    },
    {
      "comment": "Sometimes, the greatest adventures happen in the realm of dreams. Embrace the lazy!",
      "author": "hugo"
    },
    {
      "comment": "Your day of blissful sleep has inspired me to give myself permission to relax and recharge.",
      "author": "Hugo"
    },
    {
      "comment": "Sleeping all day may be frowned upon, but you've made it sound like paradise!",
      "author": "pablo"
    }
  ],
  "message": "Today, my friend, I embarked on a daring journey through the realm of slumber. I surrendered to the siren song of my cozy bed, snuggling into a nest of fluffy pillows and warm blankets. Time ceased to exist as I delved into a world of dreams, where imagination knows no bounds. In this ethereal realm, I soared through the skies like a mythical creature, danced with whimsical beings, and painted the canvas of my mind with vivid colors. It was a day of sweet surrender, where the embrace of laziness nurtured my weary soul. So, my dear adventurer, embrace the art of lazy and allow yourself the luxury of blissful sleep. The dreamscape awaits!",
  "authorUserID": {
    "$oid": "6463a460cf310f44ab767412"
  },
  "createdAt": {
    "$date": "2023-05-18T08:17:53.125Z"
  },
  "updatedAt": {
    "$date": "2023-05-18T20:22:34.542Z"
  },
  "__v": 3,
  "likes": [
    "pedro",
    "pablo",
    "night fury"
  ]
},{
  "_id": {
    "$oid": "6463a4a1cf310f44ab767423"
  },
  "comments": [
    {
      "comment": "Your festival adventure has left me itching for a front-row ticket!",
      "author": "joker"
    },
    {
      "comment": "I can practically feel the music pulsating through your festival post. Epic!",
      "author": "gollum"
    },
    {
      "comment": "If there's a festival where you're going, sign me up! Your energy is contagious.",
      "author": "hugo"
    },
    {
      "comment": "You've ignited my festival fever! I need to experience that euphoric atmosphere.",
      "author": "gollum"
    },
    {
      "comment": "Your festival escapade has me yearning for a crowd of dancing souls and electrifying tunes!",
      "author": "hugo"
    },
    {
      "comment": "Let the music guide your steps, and the festival magic forever dance in your heart!",
      "author": "gollum"
    },
    {
      "comment": "I'm living vicariously through your festival tales, and it's simply mind-blowing!",
      "author": "hugo"
    },
    {
      "comment": "Your festival experience sounds like the perfect harmony of joy and exhilaration!",
      "author": "gollum"
    }
  ],
  "message": "Prepare to be whisked away on a rollercoaster of rhythmic delights! As I entered the festival gates, the world transformed into a kaleidoscope of color and sound. The bass reverberated through my bones, and the music became the very heartbeat of my existence. I surrendered to the pulsating rhythm, moving to the enchanting melodies with an unstoppable force. Surrounded by kindred spirits, we formed a tribe of euphoria, dancing under a starlit sky. Each beat transported us to a realm where worries dissipated, and pure elation reigned. From mesmerizing light shows to spellbinding performances, the festival was a symphony of pure bliss. Let the music guide your steps, and may the festival magic forever dance in your heart!",
  "authorUserID": {
    "$oid": "64653be4da67c61249f12b3a"
  },
  "createdAt": {
    "$date": "2023-05-17T20:42:10.333Z"
  },
  "updatedAt": {
    "$date": "2023-05-18T20:22:07.494Z"
  },
  "__v": 1,
  "likes": [
    "pablo"
  ]
},{
  "_id": {
    "$oid": "6463a4a1cf310f44ab767422"
  },
  "comments": [
    {
      "comment": "Whoa, the Makers course sounds like a mind-blowing rollercoaster of learning!",
      "author": "joker"
    },
    {
      "comment": "I'm excited just reading about your Makers journey. Keep rocking it!",
      "author": "hugo"
    },
    {
      "comment": "Your enthusiasm for the Makers course is contagious! I'm signing up ASAP.",
      "author": "joker"
    },
    {
      "comment": "I think you should start your own coding revolution with all that Makers knowledge!",
      "author": "Hunight furygo"
    },
    {
      "comment": "Makers is like the magical realm of software development. I'm mesmerized!",
      "author": "night fury"
    },
    {
      "comment": "Is there a way to inject your Makers enthusiasm directly into my veins? I need it!",
      "author": "joker"
    }
  ],
  "message": "Welcome to the exhilarating world of Makers Software Developer Course! Brace yourself, my friend, because you're about to embark on an epic adventure of coding conquests and mind-bending challenges. Prepare to have your neurons fire at warp speed as you unravel the secrets of programming wizardry. With mentors as wise as Gandalf and a community as vibrant as a supernova, your journey will be nothing short of extraordinary. From diving headfirst into the realms of HTML and CSS to conquering the mighty mountains of JavaScript and beyond, you'll unlock the power to shape digital landscapes. So, grab your code sword, don your virtual armor, and get ready to conquer the software development world like a true Makers superhero!",
  "authorUserID": {
    "$oid": "646614c8b01b332791835c8d"
  },
  "createdAt": {
    "$date": "2023-05-17T18:12:27.874Z"
  },
  "updatedAt": {
    "$date": "2023-05-17T18:12:27.874Z"
  },
  "__v": 0
},{
  "_id": {
    "$oid": "6463a4a1cf310f44ab767421"
  },
  "comments": [
    {
      "comment": "Wow, your day out sounds absolutely epic! I wish I had your zest for adventure.",
      "author": "night fury"
    },
    {
      "comment": "I'm in awe of your exciting day! You should write a book about it.",
      "author": "night fury"
    },
    {
      "comment": "Seriously, can I join you on your next sun-filled escapade? It sounds like a blast!",
      "author": "gollum"
    },
    {
      "comment": "Your sun-soaked day has inspired me to plan my own thrilling outdoor adventure!",
      "author": "night fury"
    }
  ],
  "message": "Hold on to your sunhats because I'm about to take you on a wild ride! Picture this: a day out in the scorching sun, where adventure awaits at every corner. I kicked off the day with an invigorating hike up a mountain, embracing the breathtaking views and feeling the burn in my calves. But that was just the warm-up! I then leapt into a thrilling waterslide, zooming down with the adrenaline coursing through my veins. Next up, I took on the challenge of a daring zipline, soaring through the air like a superhero. As the day drew to a close, I found myself dancing under the starry sky at a mesmerizing beach party. It was a sun-drenched day filled with unforgettable moments, and I can't wait for the next adrenaline-fueled escapade!",
  "authorUserID": {
    "$oid": "6463a4d6cf310f44ab76741d"
  },
  "createdAt": {
    "$date": "2023-05-17T16:35:11.936Z"
  },
  "updatedAt": {
    "$date": "2023-05-18T20:22:39.182Z"
  },
  "__v": 1,
  "likes": [
    "night fury"
  ]
}]